/*자바의 클래스를 실행시켜보자!!
1.변수
	-메모리에 데이터 올리는법
	-js와는 달리, 자바는 데이터에 대한 정확한 자료형을 명시해야 함
2.연산자
	-메모리에 올려진 데이터에 대해 어떤 연산을 수행할지를 결정하는 기호

3.제어문
	-조건에 따라 실행부가 해당 영역을 수행할지 여부를 결정짓는 문법(조건문)
	-조건에 따라 실행부가 해당 영역을 몇회 수행할지를 결정짓는 문법(반복문)
4.함수
	-코드의 재사용
5.배열
	-대량의 데이터,규칙에 대한 처리..
6.객체
	-프로그래밍으로 현실의 사물을 표현하는법(결국 변수,함수를 하나의 묶음)
*/
//js뿐만아니라 대부분의 프로그래밍 언어가 기본문법에서는 거의 동일하다는 것 증명
//객체지향은 모든~~코드가 반드시 특정 클래스 안에 존재해야 한다!!
class Test{
	/*java.exe라는 실행프로그램은 실행대상인 클래스에게 main()메서드
	정의를 요구한다.. 즉 실행시 main을 찾는다.. 만일 main이 없으면 에러발생*/
	public static void main(String[] args){
		//콘솔창에 문자열 출력
		//var x=3; js는 실행할때마다 판단
		//int y=5; //컴파일 타임에 결정


		for(int i=1; i<=9; i++){
			System.out.println("2*"+i+"="+(2*i));
		}
		
	}


}